app/Controllers/Admin/ActivityController.php

SELECT *
FROM `activities`
ORDER BY `name` ASC
---
    public function index()
    {
        $activityModel = new Activity();

        return view('admin/activity/index', [
            'activities' => $activityModel->orderBy('name', 'ASC')->findAll(),
        ]);

SELECT *
FROM `activities`
WHERE `activities`.`id` = 3
---
    private function buildActivityPreflightError(?int $id, Activity $activityModel): ?RedirectResponse
    {
        $response = null;

        if (! $this->validate($this->rules())) {
            $response = redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        } elseif ($id !== null && $activityModel->find($id) === null) {

UPDATE `activities` SET `name` = 'Musculation modifier', `description` = 'Poids', `calories_per_hour` = 400, `intensity` = 'high', `equipment_needed` = 'Haltères', `difficulty_level` = 'intermediate', `is_active` = 1, `updated_at` = '2026-05-10 12:51:55'
WHERE `activities`.`id` IN (3)
---
    private function saveActivityRecord(Activity $activityModel, ?int $id, array $payload): ?int
    {
        if ($id === null) {
            $savedId = $activityModel->insert($payload, true);

            return $savedId !== false ? (int) $savedId : null;
        }

        if ($activityModel->update($id, $payload) === false) {

DELETE FROM `activity_objectives`
WHERE `activity_id` = 3
INSERT INTO `activity_objectives` (`activity_id`, `objective`) VALUES (3, 'loss')
---
    private function syncObjectives(int $activityId): void
    {
        $objectiveModel = new ActivityObjective();
        $objectives = $this->extractObjectives();

        $objectiveModel->where('activity_id', $activityId)->delete();

        foreach ($objectives as $objective) {
            $objectiveModel->insert([
                'activity_id' => $activityId,
                'objective' => $objective,
            ]);