app/Controllers/Admin/DashboardController.php

SELECT DATE(created_at) as signup_date, COUNT(id) as total_signups
FROM `users`
WHERE `created_at` >= '2026-05-04 13:41:46'
GROUP BY DATE(created_at)
---
    private function getWeeklyStats($db): array
    {
        $weeklyRevenues = [];
        $weeklyInscriptions = [];

        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $weeklyRevenues[$date] = 0;
            $weeklyInscriptions[$date] = 0;
        }

        if ($db->tableExists('user_regimes')) {
            $revenues = $db->table('user_regimes ur')
                ->select("DATE(ur.purchased_at) as purchase_date, SUM(ur.price_paid) as total_revenue")
                ->where('ur.purchased_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
                ->groupBy("DATE(ur.purchased_at)")
                ->get()
                ->getResultArray();

            foreach ($revenues as $row) {
                $date = (string) ($row['purchase_date'] ?? '');
                if ($date && isset($weeklyRevenues[$date])) {
                    $weeklyRevenues[$date] = (float) ($row['total_revenue'] ?? 0);
                }
            }
        }

        if ($db->tableExists('users')) {
            $inscriptions = $db->table('users')
                ->select("DATE(created_at) as signup_date, COUNT(id) as total_signups")
                ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
                ->groupBy("DATE(created_at)")
                ->get()
                ->getResultArray();