app/Controllers/Admin/DashboardController.php

    private function countUsers($db): int
    {
        if (! $db->tableExists('users')) {
            return 0;
        }

        return (int) $db->table('users')
            ->where('is_admin', 0)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0

    private function countActiveSubscriptions($db): int
    {
        if (! $db->tableExists('user_regimes')) {
            return 0;
        }

        return (int) $db->table('user_regimes')
            ->where('is_active', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_regimes`
WHERE `is_active` = 1

    private function sumMonthlyRevenue($db): float
    {
        if (! $db->tableExists('user_regimes')) {
            return 0.0;
        }

        $result = $db->table('user_regimes')
            ->selectSum('price_paid', 'total')
            ->where('YEAR(purchased_at)', date('Y'))
            ->where('MONTH(purchased_at)', date('m'))
            ->get()
            ->getRowArray();
---
SELECT SUM(`price_paid`) AS `total`
FROM `user_regimes`
WHERE YEAR(purchased_at) = '2026'
AND MONTH(purchased_at) = '05'

    private function countGoldUsers($db): int
    {
        if (! $db->tableExists('users')) {
            return 0;
        }

        return (int) $db->table('users')
            ->where('is_gold', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1

    private function getGoldStats($db): array
    {
        if (! $db->tableExists('users')) {
            return [
                'gold_users' => 0,
                'retention_rate' => 0,
                'avg_ltv' => 0,
                'support_score' => 0,
            ];
        }

        $goldUsers = (int) $db->table('users')->where('is_admin', 0)->where('is_gold', 1)->countAllResults();

        if ($goldUsers === 0) {
            return [
                'gold_users' => 0,
                'retention_rate' => 0,
                'avg_ltv' => 0,
                'support_score' => 0,
            ];
        }

        $activeGoldUsers = (int) $db->table('users')
            ->where('is_admin', 0)
            ->where('is_gold', 1)
            ->where('is_active', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `is_gold` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `is_gold` = 1
AND `is_active` = 1


        $avgLtv = 0.0;
        if ($db->tableExists('user_regimes')) {
            $ltvRow = $db->table('user_regimes ur')
                ->select('AVG(ur.price_paid) AS avg_ltv')
                ->join('users u', 'u.id = ur.user_id', 'inner')
                ->where('u.is_admin', 0)
                ->where('u.is_gold', 1)
                ->get()
                ->getRowArray();
---
SELECT AVG(ur.price_paid) AS avg_ltv
FROM `user_regimes` `ur`
INNER JOIN `users` `u` ON `u`.`id` = `ur`.`user_id`
WHERE `u`.`is_admin` = 0
AND `u`.`is_gold` = 1

            $avgLtv = (float) ($ltvRow['avg_ltv'] ?? 0);
        }

        $last7DaysGoldLogins = (int) $db->table('users')
            ->where('is_admin', 0)
            ->where('is_gold', 1)
            ->where('last_login >=', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `is_gold` = 1
AND `last_login` >= '2026-05-04 19:40:53'

    private function getWeeklyStats($db): array
    {
        $weeklyRevenues = [];
        $weeklyInscriptions = [];

        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $weeklyRevenues[$date] = 0;
            $weeklyInscriptions[$date] = 0;
        }

        if ($db->tableExists('user_regimes')) {
            $revenues = $db->table('user_regimes ur')
                ->select("DATE(ur.purchased_at) as purchase_date, SUM(ur.price_paid) as total_revenue")
                ->where('ur.purchased_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
                ->groupBy("DATE(ur.purchased_at)")
                ->get()
                ->getResultArray();

            foreach ($revenues as $row) {
                $date = (string) ($row['purchase_date'] ?? '');
                if ($date && isset($weeklyRevenues[$date])) {
                    $weeklyRevenues[$date] = (float) ($row['total_revenue'] ?? 0);
                }
            }
        }

        if ($db->tableExists('users')) {
            $inscriptions = $db->table('users')
                ->select("DATE(created_at) as signup_date, COUNT(id) as total_signups")
                ->where('is_admin', 0)
                ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
                ->groupBy("DATE(created_at)")
                ->get()
                ->getResultArray();
---
SELECT DATE(ur.purchased_at) as purchase_date, SUM(ur.price_paid) as total_revenue
FROM `user_regimes` `ur`
WHERE `ur`.`purchased_at` >= '2026-05-04 19:40:53'
GROUP BY DATE(ur.purchased_at)
SELECT DATE(created_at) as signup_date, COUNT(id) as total_signups
FROM `users`
WHERE `is_admin` = 0
AND `created_at` >= '2026-05-04 19:40:53'
GROUP BY DATE(created_at)