app/Controllers/Admin/RegimeController.php

SELECT *
FROM `regimes`
ORDER BY `name` ASC
---
    public function index()
    {
        $regimeModel = new Regime();

        return view('admin/regime/index', [
            'regimes' => $regimeModel->orderBy('name', 'ASC')->findAll(),
            'regime' => null,
            'objectives' => [],
        ]);

SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 5
SELECT *
FROM `regimes`
ORDER BY `name` ASC
---
    public function edit(int $id)
    {
        $regimeModel = new Regime();
        $regime = $regimeModel->find($id);
        $response = redirect()->to(self::INDEX_ROUTE);
        $db = db_connect();

        if ($regime === null) {
            $response = $response->with('error', self::MSG_NOT_FOUND);
        } else {
            $objectiveModel = new RegimeObjective();
            $objectives = [];

            if ($db->tableExists('regime_objectives')) {
                $objectives = array_column($objectiveModel->getObjectivesByRegime($id), 'objective');
            }

            $response = view('admin/regime/index', [
                'regimes' => $regimeModel->orderBy('name', 'ASC')->findAll(),
                'regime' => $regime,
                'objectives' => $objectives,
            ]);

SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 5
---
    private function buildRegimePreflightError(?int $id, Regime $regimeModel): ?RedirectResponse
    {
        $response = null;

        if (! $this->validate($this->rules())) {
            $response = redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        } elseif ($id !== null && $regimeModel->find($id) === null) {

UPDATE `regimes` SET `name` = 'Détox Printanier', `description` = 'Détox', `calorie_target` = 1800, `price_per_week` = 13.99, `duration_weeks` = 3, `weight_change_percent` = -1.5, `meat_percent` = 10, `fish_percent` = 15, `poultry_percent` = 75, `is_active` = 1, `updated_at` = '2026-05-10 12:54:55'
WHERE `regimes`.`id` IN (5)
---
    private function saveRegimeRecord(Regime $regimeModel, ?int $id, array $payload): ?int
    {
        if ($id === null) {
            $savedId = $regimeModel->insert($payload, true);

            return $savedId !== false ? (int) $savedId : null;
        }

        if ($regimeModel->update($id, $payload) === false) {

DELETE FROM `regime_objectives`
WHERE `regime_id` = 5
---
    private function syncObjectives(int $regimeId): void
    {
        $db = db_connect();

        if (! $db->tableExists('regime_objectives')) {
            return;
        }

        $objectiveModel = new RegimeObjective();
        $objectives = $this->extractObjectives();

        $objectiveModel->where('regime_id', $regimeId)->delete();