app/Views/admin/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `created_at` >= '2026-05-04 19:40:53'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `created_at` < '2026-05-04 19:40:53'
AND `created_at` >= '2026-04-27 19:40:53'
---
$goldUsersChangePercent = 0;

if ($db = db_connect()) {
    $thisWeekUsers = $db->table('users')
        ->where('is_admin', 0)
        ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
        ->countAllResults();
    $lastWeekUsers = $db->table('users')
        ->where('is_admin', 0)
        ->where('created_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
        ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `is_gold` = 1
AND `created_at` >= '2026-05-04 19:40:53'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_admin` = 0
AND `is_gold` = 1
AND `created_at` < '2026-05-04 19:40:53'
AND `created_at` >= '2026-04-27 19:40:53'
---
    }

    if ($db->tableExists('users')) {
        $thisWeekGoldUsers = $db->table('users')
            ->where('is_admin', 0)
            ->where('is_gold', 1)
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->countAllResults();
        $lastWeekGoldUsers = $db->table('users')
            ->where('is_admin', 0)
            ->where('is_gold', 1)
            ->where('created_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
            ->countAllResults();