app/Views/admin/dashboard.php


if ($db = db_connect()) {
    // Users added this week vs last week
    $thisWeekUsers = $db->table('users')
        ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
        ->countAllResults();
    $lastWeekUsers = $db->table('users')
        ->where('created_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
        ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2026-05-03 19:22:23'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` < '2026-05-03 19:22:23'
AND `created_at` >= '2026-04-26 19:22:23'

    // Revenue comparison
    $thisWeekRevenue = array_sum($revenueData);
    if ($db->tableExists('user_regimes')) {
        $lastWeekRevenue = $db->table('user_regimes')
            ->selectSum('price_paid', 'total')
            ->where('purchased_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->where('purchased_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
            ->get()
            ->getRow();
---
SELECT SUM(`price_paid`) AS `total`
FROM `user_regimes`
WHERE `purchased_at` < '2026-05-04 13:41:46'
AND `purchased_at` >= '2026-04-27 13:41:46'

    $thisWeekSubs = 0;
    $lastWeekSubs = 0;
    if ($db->tableExists('user_regimes')) {
        $thisWeekSubs = $db->table('user_regimes')
            ->where('purchased_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->where('is_active', 1)
            ->countAllResults();
        $lastWeekSubs = $db->table('user_regimes')
            ->where('purchased_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->where('purchased_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
            ->where('is_active', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_regimes`
WHERE `purchased_at` >= '2026-05-04 13:41:46'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `user_regimes`
WHERE `purchased_at` < '2026-05-04 13:41:46'
AND `purchased_at` >= '2026-04-27 13:41:46'
AND `is_active` = 1


    // Gold users change
    if ($db->tableExists('users')) {
        $thisWeekGoldUsers = $db->table('users')
            ->where('is_gold', 1)
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->countAllResults();
        $lastWeekGoldUsers = $db->table('users')
            ->where('is_gold', 1)
            ->where('created_at <', date('Y-m-d H:i:s', strtotime('-6 days')))
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime('-13 days')))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
AND `created_at` < '2026-05-03 19:22:23'
AND `created_at` >= '2026-04-26 19:22:23'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
AND `created_at` < '2026-05-04 13:41:46'
AND `created_at` >= '2026-04-27 13:41:46'