app/Controllers/DashboardController.php

    public function index()
    {
        $userId = (int) (session()->get('user_id') ?? 0);

        if ($userId <= 0) {
            return redirect()->to('/auth/login');
        }

        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 3


        if (!empty($activePurchases)) {
            $latestPurchase = $activePurchases[0];
            $currentRegime = $this->regimeModel->find((int) ($latestPurchase['regime_id'] ?? 0));
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 5