app/Controllers/ProfileController.php

    public function view()
    {
        $userId = (int) (session()->get('user_id') ?? 0);

        if ($userId <= 0) {
            return redirect()->to('/auth/login');
        }

        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 3