app/Controllers/RegimeController.php

    public function catalog()
    {
        $userId = (int) ($this->session->get('user_id') ?? 0);
        if ($userId === 0) {
            return redirect()->to('/auth/login');
        }

        $regimeModel = new Regime();
        $userRegimeModel = new UserRegime();

        $regimes = $regimeModel->where('is_active', 1)->findAll();
        $purchases = $userRegimeModel->getUserPurchases($userId);

        $purchasedRegimeIds = [];
        foreach ($purchases as $purchase) {
            $purchasedRegimeIds[] = (int) ($purchase['regime_id'] ?? 0);
        }

        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `regimes`
WHERE `is_active` = 1
SELECT *
FROM `users`
WHERE `id` = 2

    public function purchase(int $regimeId)
    {
        if (!$this->request->is('post')) {
            return redirect()->back();
        }

        $userId = (int) ($this->session->get('user_id') ?? 0);
        if ($userId === 0) {
            return redirect()->to('/auth/login');
        }

        $regimeModel = new Regime();
        $userRegimeModel = new UserRegime();
        $walletModel = new Wallet();

        $regime = $regimeModel->find($regimeId);
        if (!$regime) {
            $this->session->setFlashdata('error', 'Régime non trouvé.');
            return redirect()->back();
        }

        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray();
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 5
SELECT *
FROM `users`
WHERE `id` = 2