app/Controllers/WalletController.php

SELECT *
FROM `promo_codes`
WHERE `used_by_user_id` = 1
ORDER BY `used_at` DESC
SELECT *
FROM `users`
WHERE `id` = 1
SELECT `ur`.*, `r`.`name` AS `regime_name`
FROM `user_regimes` `ur`
LEFT JOIN `regimes` `r` ON `r`.`id` = `ur`.`regime_id`
WHERE `ur`.`user_id` = 1
ORDER BY `ur`.`purchased_at` DESC
---
    public function index()
    {
        $userId = (int) ($this->session->get('user_id') ?? 0);
        if ($userId === 0) {
            return redirect()->to('/auth/login');
        }

        $walletModel = new Wallet();
        $promoModel = new PromoCode();

        $balance = $walletModel->getBalance($userId);

        $usedCodes = $promoModel->where('used_by_user_id', $userId)
            ->orderBy('used_at', 'DESC')
            ->findAll();

        $db = db_connect();
        $user = $db->table('users')->where('id', $userId)->get()->getRowArray();
        $purchases = [];
        if ($db->tableExists('user_regimes')) {
            $purchases = $db->table('user_regimes ur')
                ->select('ur.*, r.name AS regime_name')
                ->join('regimes r', 'r.id = ur.regime_id', 'left')
                ->where('ur.user_id', $userId)
                ->orderBy('ur.purchased_at', 'DESC')
                ->get()
                ->getResultArray();

SELECT *
FROM `offers`
WHERE `is_active` = 1
 LIMIT 1
---
        }

        $offer = null;
        $offerDb = $db->table('offers')->where('is_active', 1)->limit(1)->get()->getRowArray();