app/Models/Activity.php

SELECT *
FROM `activities`
JOIN `activity_objectives` ON `activities`.`id` = `activity_objectives`.`activity_id`
WHERE `activity_objectives`.`objective` = 'imc_ideal'
AND `activities`.`is_active` = 1
---
    public function getByObjective($objective)
    {
        return $this->join('activity_objectives', 'activities.id = activity_objectives.activity_id')
                    ->where('activity_objectives.objective', $objective)
                    ->where('activities.is_active', 1)
                    ->findAll();

SELECT *
FROM `activities`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function getActiveActivities()
    {
        return $this->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->findAll();