app/Models/Regime.php

    public function getByObjective($objective)
    {
        return $this->join('regime_objectives', 'regimes.id = regime_objectives.regime_id')
                    ->where('regime_objectives.objective', $objective)
                    ->where('regimes.is_active', 1)
                    ->findAll();
---
SELECT *
FROM `regimes`
JOIN `regime_objectives` ON `regimes`.`id` = `regime_objectives`.`regime_id`
WHERE `regime_objectives`.`objective` = 'imc_ideal'
AND `regimes`.`is_active` = 1

    public function getActiveRegimes()
    {
        return $this->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->findAll();
---
SELECT *
FROM `regimes`
WHERE `is_active` = 1
ORDER BY `name` ASC