app/Models/RegimeObjective.php

SELECT *
FROM `regime_objectives`
WHERE `regime_id` = 5
---
    public function getObjectivesByRegime($regime_id)
    {
        return $this->where('regime_id', $regime_id)
                    ->findAll();