app/Models/User.php

    public function emailExists($email)
    {
        return $this->where('email', $email)->first() !== null;
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1

    public function getByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'user@gmail.com'
 LIMIT 1

    public function updateLastLogin($userId)
    {
        return $this->update($userId, ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2026-05-10 12:21:41'
WHERE `users`.`id` IN ('2')