app/Models/UserRegime.php

    public function purchaseRegime(int $userId, int $regimeId, float $pricePaid, ?string $startsAt = null, ?string $endsAt = null)
    {
        $data = [
            'user_id' => $userId,
            'regime_id' => $regimeId,
            'price_paid' => $pricePaid,
            'purchased_at' => date('Y-m-d H:i:s'),
            'starts_at' => $startsAt,
            'ends_at' => $endsAt,
            'is_active' => 1,
        ];

        return $this->insert($data);
---
INSERT INTO `user_regimes` (`user_id`, `regime_id`, `price_paid`, `purchased_at`, `starts_at`, `ends_at`, `is_active`, `created_at`, `updated_at`) VALUES (2, 5, 35.6745, '2026-05-10 15:16:57', '2026-05-10 15:16:57', '2026-05-31 15:16:57', 1, '2026-05-10 15:16:57', '2026-05-10 15:16:57')

    public function getUserPurchases(int $userId)
    {
        return $this->where('user_id', $userId)
            ->orderBy('purchased_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `user_regimes`
WHERE `user_id` = 2
ORDER BY `purchased_at` DESC

    public function getActivePurchases(int $userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_active', 1)
            ->orderBy('purchased_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `user_regimes`
WHERE `user_id` = 2
AND `is_active` = 1
ORDER BY `purchased_at` DESC