app/Models/Wallet.php

SELECT *
FROM `wallets`
WHERE `user_id` = 2
 LIMIT 1
---
    public function getBalance(int $userId): float
    {
        $wallet = $this->where('user_id', $userId)->first();

SELECT *
FROM `wallets`
WHERE `user_id` = 2
 LIMIT 1
UPDATE `wallets` SET `balance` = 15.3255, `updated_at` = '2026-05-10 15:16:57'
WHERE `wallets`.`id` IN (2)
---
    public function subtractBalance(int $userId, float $amount): bool
    {
        if ($amount <= 0) {
            return false;
        }

        $db = $this->db;
        $db->transBegin();

        $wallet = $this->where('user_id', $userId)->first();
        $currentBalance = (float) ($wallet['balance'] ?? 0);

        if ($currentBalance < $amount) {
            $db->transRollback();
            return false;
        }

        $newBalance = $currentBalance - $amount;
        $this->update((int) $wallet['id'], ['balance' => $newBalance]);